app/views/movies/_form.html.erb

SELECT  "genres".* FROM "genres" ORDER BY "genres"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
      <li>
        <%= f.collection_check_boxes(:genre_ids, Genre.all, :id, :name) do |b| %>