app/controllers/favorites_controller.rb

  def create
    unless @movie.fans.include?(current_user)
      @movie.favorites.create(user: current_user)
---
INSERT INTO "favorites" ("movie_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["movie_id", 1], ["user_id", 2], ["created_at", 2017-02-08 01:00:08 UTC], ["updated_at", 2017-02-08 01:00:08 UTC]]

  def destroy
    favorite = current_user.favorites.find(params[:id])
    favorite.destroy
---
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."id" = ? LIMIT ?  [["user_id", 2], ["id", 2], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 2]]

    def set_movie
      @movie = Movie.find(params[:movie_id])
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]