app/controllers/genres_controller.rb

  def index
    @genres = Genre.all
---
SELECT "genres".* FROM "genres"

  def show
    @genre = Genre.find(params[:id])
---
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @genre = Genre.new(genre_params)
    if @genre.save
---
INSERT INTO "genres" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Amazing"], ["created_at", 2017-02-09 23:55:33 UTC], ["updated_at", 2017-02-09 23:55:33 UTC]]

  def edit
    @genre = Genre.find(params[:id])
---
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @genre = Genre.find(params[:id])
---
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy
    @genre = Genre.find(params[:id])
    @genre.destroy
---
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
DELETE FROM "genres" WHERE "genres"."id" = ?  [["id", 11]]