app/controllers/reviews_controller.rb

  def create
    @review = @movie.reviews.new(review_params)
    respond_to do |format|
      if @review.save
---
INSERT INTO "reviews" ("stars", "comment", "movie_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["stars", 5], ["comment", "Testing!!"], ["movie_id", 1], ["created_at", 2017-02-05 19:51:00 UTC], ["updated_at", 2017-02-05 19:51:00 UTC], ["user_id", 1]]

  def destroy
    @review = Review.find(params[:id])
    @review.destroy
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 2]]

  def edit
    @review = Review.find(params[:id])
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @review = Review.find(params[:id])
    if @review.update(review_params)
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "reviews" SET "stars" = ?, "comment" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["stars", 1], ["comment", "WOWWWWWWqqqqqqqqqqq"], ["updated_at", 2017-01-26 22:13:14 UTC], ["id", 1]]

    def set_movie
      @movie = Movie.find(params[:movie_id])
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]