app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "username" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Gerald"], ["username", "gerald01"], ["updated_at", 2017-02-05 04:22:21 UTC], ["id", 1]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)