app/views/reviews/_review.html.erb

  <span class="user">by <%= review.name %></span>
  <span class="date"><%= time_ago_in_words(review.created_at) %> ago</span>
---
INSERT INTO "reviews" ("name", "stars", "comment", "movie_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Orange"], ["stars", 1], ["comment", "yes!!!"], ["movie_id", 1], ["created_at", 2017-01-28 01:42:46 UTC], ["updated_at", 2017-01-28 01:42:46 UTC]]